package ru.ezhov.checkedvsuncheckedexceptions.application.iterations.it2;

public class Application23 {
    /**
     * Наше приложение трудится на благо и клиенты хотят развить его ещё больше, а именно:
     *
     * 1. Сделать из него WEB приложение со следующей логикой:
     *  1. Если передано название файла, то брать данные из файла
     *  2. Если файл не передан, брать данные из базы данных
     *  3. Если база данных недоступна, брать данные из дефолтного файла
     *  4. Если дефолтный файл недоступен бросать ошибку
     *
     *  На что стоит обратить внимание.
     *
     *  Мы помним с вами реализацию чтения файла, и возможность выбрасывания двух исключений.
     *  1. Когда файл не найден
     *  2. Когда мы не смогли прочитать этот файл
     *
     *  // TODO ezhov продолжить
     */
}
