package ru.ezhov.checkedvsuncheckedexceptions.application.iterations.i1;

public class Application20 {
    /**
     * Промежуточный итог.
     *
     * За время развития нашего приложения, нам удалось убедиться в следующих высказываниях:
     *
     * 1. Исключения, как проверяемые, так и непроверяемые, являются важной составляющей приложения.
     * Они позволяют разработчику реагировать на исключительные ситуации так, как этого требуют сценарии.
     *
     * 2. Непроверяемые исключения позволяют удобно работать с lambda выражениями, но не проявляют контракта методов.
     * Постоянно приходится погружаться в код и выискивать возможные исключения для их обработки.
     *
     * 3. Проверяемые исключения вносят неудобства при работе с lambda выражениями, но как мы убедились, этот кейс
     * напрямую связан с особенностями lambda выражение, так как в другой итерации с БД, такой проблемы уже нет.
     *
     * 4. Проверяемые исключения позволяют проявить контракт метода убрать неактуальные исключения из кода.
     *
     * Прежде, чем мы продолжим развивать наше приложение, сделаем небольшое отступление
     * @see Application20
     */
}
